[
    {
        "id": "1",
        "title": "Site \"mobile first\" pour une startup de la restauration",
        "cover": "./src/assets/images-projet/ohmyfood.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: Le site devait permettre aux utilisateurs de consulter les menus de restaurants partenaires et de composer leur repas en ligne afin que les plats soient prêts à leur arrivée au restaurant. L'objectif était de réduire le temps d'attente en salle et d'améliorer l'expérience client.\nMA CONTRIBUTION :\n- Développer une interface responsive pour mobile, tablette et desktop, en suivant l'approche mobile-first. Intégrer des animations CSS fluides et subtiles pour améliorer l'interactivité du site, notamment avec des effets au survol et des transitions sur les différents états des composants.\n- Utiliser SASS pour une meilleure organisation et réutilisabilité des styles CSS, facilitant la gestion des différents breakpoints.\n- Respecter les maquettes fournies par l'UX designer et le prototype interactif sur Figma, en collaboration avec l'équipe technique, afin d'assurer une fidélité visuelle et fonctionnelle au design initial.\n- Optimiser l'expérience utilisateur avec des temps de chargement réduits et une navigation fluide sur tous les supports.",
        "type": "Site Web",
        "lienSite": "https://3m3line.github.io/P4-ohmyfood/Projet-4_oh-my-food_Emeline-Boureaud/SRC/index.html",
        "lienCode": "https://github.com/3m3line/P4-ohmyfood.git",
        "technologie": [
            "SASS",
            "CSS",
            "ANIMATION",
            "HTML"
        ],
        "dateCreation": "mai-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "2",
        "title": "Dynamisation du site web d'une imprimerie familiale",
        "cover": "./src/assets/images-projet/print-it.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: L'objectif principal était d'apporter une modification au site vitrine en créant un carrousel dynamique permettant aux utilisateurs de naviguer facilement entre différentes images, avec des flèches et des points indicateurs pour une meilleure expérience utilisateur. Ce carrousel devait être intuitif, responsive et fonctionner de manière fluide sur tous les appareils.\nMA CONTRIBUTION :\n- Mise en place des flèches de navigation : En intégrant des images de flèches (gauche et droite) dans le carrousel, j'ai permis aux utilisateurs de passer d'une image à l'autre facilement. J'ai ajouté des event listeners en JavaScript pour gérer les clics sur ces flèches et déclencher les actions nécessaires.\n-Ajout des bullet points : J'ai introduit des points indicateurs en bas du carrousel pour que les utilisateurs puissent identifier sur quelle slide ils se trouvent. Le point actif était visuellement distingué grâce à des classes CSS spécifiques.\n-Interactivité du carrousel : Le carrousel devait afficher une nouvelle image et son texte associé à chaque clic, tout en mettant à jour le point correspondant. J'ai utilisé JavaScript pour gérer ces changements via le DOM, en ajustant le contenu et le style en fonction de l'image active.\n-Gestion des conditions de boucle : J'ai veillé à ce que le carrousel fonctionne en boucle. Lorsque l'utilisateur atteignait la dernière image et cliquait à droite, le carrousel revenait à la première image, et inversement pour la première image en cliquant à gauche.",
        "type": "Site Web",
        "lienSite": "https://3m3line.github.io/P5-PRINTIT/",
        "lienCode": "https://github.com/3m3line/P5-PRINTIT.git",
        "technologie": [
            "HTML",
            "CSS",
            "JAVASCRIPT"
        ],
        "dateCreation": "mai-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "3",
        "title": "Portfolio d'une architecte d'intérieur",
        "cover": "./src/assets/images-projet/sophie-bluel.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: Obtenir un site web dynamique pour le portfolio d'une architecte d'intérieur lui permettant de se connecter pour qu'elle gère ses travaux (ajout, suppression).\nMA CONTRIBUTION :\n- Dynamisation de la galerie des travaux : J'ai récupéré les projets de l'architecte via des appels API et affiché ces données dynamiquement sur la page en supprimant le contenu statique. J'ai également implémenté un système de filtres par catégorie.\n- Création de la page de connexion : J'ai développé la page de login pour l'administrateur, intégré le design, et mis en place l'authentification avec gestion des erreurs et redirection après connexion.\n- Développement de la modale d'ajout de médias : J'ai créé une fenêtre modale pour permettre l'ajout de nouveaux projets et leur suppression, tout en assurant la mise à jour dynamique de la galerie sans rechargement de la page.",
        "type": "Site Web",
        "lienSite": "",
        "lienCode": "https://github.com/3m3line/P6-Sophie-Bluel.git",
        "technologie": [
            "HTML",
            "CSS",
            "JAVASCRIPT",
            "API REST"
        ],
        "dateCreation": "juin-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "4",
        "title": "Refonte d'un site de location d'appartements entre particuliers",
        "cover": "./src/assets/images-projet//kasa.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: La refonte du site Kasa avait pour but de moderniser l’architecture du site vieux de plus de 10 ans. Le projet visait à migrer vers une stack JavaScript moderne, avec React pour le front-end, tout en offrant une expérience utilisateur fluide et responsive basée sur des maquettes Figma. Le défi était de développer une interface intuitive permettant de naviguer facilement entre les différentes annonces et fonctionnalités proposées par la plateforme.\nMA CONTRIBUTION :\n- Développement du projet React en suivant les maquettes Figma pour créer une interface utilisateur responsive et mise en place de react Router (navigation entre les pages, gestion de la redirection et des erreurs).\n- Développement de composants réutilisables tels que la bannière, les cartes de propriétés, le menu déroulant (Collapse) et la galerie photo (Slideshow).\n- Intégration des données JSON fournies pour simuler les appels à l'API back-end et afficher dynamiquement les propriétés sur le site.\n- Utilisation de Sass pour structurer et générer le CSS, tout en respectant les guidelines de Kasa.\n- Animation des menus déroulants et des composants interactifs pour améliorer l’expérience utilisateur.",
        "type": "Site Web",
        "lienSite": "",
        "lienCode": "https://github.com/3m3line/P7-kasa.git",
        "technologie": [
            "REACT",
            "REACT ROUTER",
            "JAVASCRIPT",
            "API REST",
            "SASS",
            "VITE"
        ],
        "dateCreation": "juil-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "5",
        "title": "Développement d'un tableau de bord utilisateur pour une banque en ligne",
        "cover": "./src/assets/images-projet/argentbank.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: L'objectif principal de ce projet était de développer le tableau de bord des utilisateurs pour Argent Bank, une banque en ligne souhaitant se positionner sur le marché bancaire numérique. En tant que développeur front-end, j'ai participé à la création d'une application web réactive et sécurisée permettant aux utilisateurs de gérer leur profil, de se connecter et de naviguer facilement dans l'application.\nMA CONTRIBUTION :\n- Développement d'une application web avec React : J'ai mis en place une architecture en composants réutilisables pour les différentes pages de l'application, comme la page d'accueil, la page de connexion et la page de profil.\n- Gestion des états avec Redux : J'ai intégré Redux pour centraliser la gestion de l'état global de l'application, permettant une gestion fluide des données de session utilisateur et des erreurs d'authentification.\n- Sécurisation de la connexion utilisateur : Mise en place de l'authentification avec gestion des erreurs de connexion, protection des routes et déconnexion sécurisée.\n- Optimisation Green Code : En suivant les bonnes pratiques du Green Code, j'ai optimisé les images et créé des composants modulaires pour réduire l'empreinte écologique du site.\n- Intégration de l'API REST : Utilisation des routes API fournies pour récupérer et mettre à jour les données du profil utilisateur, tout en respectant les standards de Swagger.\n- Conception des endpoints pour les transactions : J'ai proposé un modèle d'API pour la gestion des transactions utilisateur, en définissant les routes et les méthodes HTTP nécessaires dans un document Swagger.",
        "type": "Site Web",
        "lienSite": "",
        "lienCode": "https://github.com/3m3line/P10_ArgentBank.git",
        "technologie": [
            "REACT",
            "REACT ROUTER",
            "JAVASCRIPT",
            "API REST",
            "REDUX",
            "SWAGGER",
            "CSS"
        ],
        "dateCreation": "août-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "6",
        "title": "Projet de site pour une association",
        "cover": "./src/assets/images-projet/asl-les-cottages_image.png",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: L'objectif de ce projet était de concevoir et de développer un site web pour une Association Syndicale Libre (ASL) regroupant un ensemble immobilier de maisons. Le site devait permettre aux membres de l'ASL d'accéder facilement à des informations clés, tout en offrant une interface utilisateur claire et intuitive. Il comprenait notamment une page d'accueil présentant l'ASL, une section pour les questions fréquentes, un espace sécurisé pour accéder aux documents de l'ASL, une page de contact, ainsi qu'une intégration des communications d'un groupe Facebook.\nMA CONTRIBUTION :\n- Design complet du site : Création de l'identité visuelle du site, y compris les choix de couleurs, typographie, et design des visuels personnalisés.\n- Développement avec WordPress : Conception et mise en place du site web via le CMS WordPress, assurant une gestion facile des contenus pour les administrateurs de l'ASL.\n- Espace sécurisé pour les membres : Mise en place d'un système de connexion pour permettre aux utilisateurs d'accéder aux documents essentiels (procès-verbaux, convocations, règlement de copropriété).",
        "type": "Site Web",
        "lienSite": "https://asl-lescottages.fr/",
        "lienCode": "",
        "technologie": [
            "WORDPRESS",
            "CSS"
        ],
        "dateCreation": "févr-24",
        "statut": "TERMINÉ"
    },
    {
        "id": "7",
        "title": "Application de Gestion de Tâches",
        "cover": "",
        "dessin":"./src/assets/images-projet/test.png",
        "description": "OBJECTIF: Le but de ce projet est de développer une application web dédiée à la gestion des tâches quotidiennes à répartir au sein d'un groupe. L'application vise à faciliter l'organisation des tâches, comme le ménage dans un couple, en permettant une répartition efficace, une validation à la réalisation et la possibilité de définir des tâches récurrentes. L'application offrira une expérience utilisateur fluide et intuitive.\nMA CONTRIBUTION :\n- Conception de l'application : Réalisation du design de l'application, en veillant à ce qu'il soit à la fois esthétique et fonctionnel pour une navigation fluide.\n- Développement Front-End : Création de l'interface utilisateur avec des fonctionnalités réactives et intuitives, permettant aux utilisateurs de créer et gérer facilement leurs tâches.\n- Développement Back-End : Mise en place de l'architecture serveur pour gérer les données des utilisateurs, l'authentification et la gestion des tâches, garantissant la sécurité et l'intégrité des informations.\n- Gestion des tâches : Implémentation de la logique de création, de validation et de répétition des tâches, ainsi que la possibilité de définir des durées pour chaque tâche.\n- Répartition des tâches : Développement d'un système permettant de répartir les tâches entre les membres du groupe, avec des notifications pour tenir tout le monde informé.\n- Mise en ligne de l'application : Publication de l'application sur un serveur web, assurant son accessibilité pour tous les utilisateurs.",
        "type": "Application",
        "lienSite": "",
        "lienCode": "",
        "technologie": [],
        "dateCreation": "",
        "statut": "EN COURS"
    }
]
